---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.OuterFillet
source: html/08273706-d15d-2baa-e00b-983e576e44c6.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.OuterFillet Property

Outer Fillet - Corner fillet outer radius.

## Syntax (C#)
```csharp
public double OuterFillet { get; set; }
```